"""
day05 复习
    容器
        1. 字符串 str
            （1）定义 由一系列字符组成的不可变序列
            （2）字面值: '' "" 三引号
                转义符：改变字符原始含义的特殊字符
                字符串格式化："...格式%s..." %(变量值)

        2. 列表 list
            （1）定义 由一些列变量组成的可变序列
            （2）操作
                创建:[]    list()
                添加:
                    末尾追加:  列表名称.append(元素)
                    中间位置插入:  列表名称.insert(索引,元素)
                删除: del 列表名称[索引]
                     del 列表名称[切片]
                    删除元素:  列表名称.remove(元素)
                修改:  列表名称[索引] = 元素
                        列表名称[切片] = 元素
                查询:  列表名称[索引]
                        列表名称[切片]
"""
